In [1]:
!pip3 install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\nived\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.9.9)

[notice] A new release of pip is available: 23.2.1 -> 24.0
[notice] To update, run: C:\Users\nived\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import os
import os

os.getcwd()

'C:\\Users\\nived\\Documents\\bootcamp\\Project week 21\\notebooks'

In [3]:
# Reading the online_transactions_cleaned file
online_transactions_cleaned=pd.read_csv("../data/online_transactions_cleaned.csv")

In [4]:
type(online_transactions_cleaned)

pandas.core.frame.DataFrame

In [5]:
# finding the number of columns and rows
online_transactions_cleaned.shape

(408816, 8)

In [6]:
#getting the info of the table
online_transactions_cleaned.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 408816 entries, 0 to 408815
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice       408816 non-null  object
 1   stock_code    408816 non-null  object
 2   quantity      408816 non-null  int64
 3   invoice_date  408816 non-null  object
 4   price         408816 non-null  float64
 5   customer_id   408816 non-null  object
 6   country       408816 non-null  object
 7   description   408816 non-null  object
dtypes: float64(1), int64(1), object(6)
memory usage: 25.0+ MB

In [7]:
# # Establishing the connection 

dbname = "dev"
host = "redshift-cluster-1.c9gt5btzchps.eu-central-1.redshift.amazonaws.com"
port = 5439
user = "ramya"
password = "jw8s0F4123"

In [8]:
import psycopg2

In [9]:
connect = psycopg2.connect(dbname=dbname, host=host, port=port, user=user, password=password)
connect

In [10]:
# selecting the records from online transactions cleaned table
query="""select*
from bootcamp.online_transactions_cleaned
limit 10
"""

In [11]:
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\2253160645.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

,invoice,stock_code,description,price,quantity,total_order_value,invoice_date,customer_id,country
0,536370,21791,VINTAGE HEADS AND TAILS CARD GAME,1.25,24,30.00,2010-12-01 08:45:00,u12583,France
1,536385,22783,SET 3 WICKER OVAL BASKETS W LIDS,19.95,1,19.95,2010-12-01 09:56:00,u1742,United Kingdom
2,536392,22128,PARTY CONES CANDY ASSORTED,1.25,12,15.00,2010-12-01 10:29:00,u13705,United Kingdom
3,536404,22469,HEART OF WICKER SMALL,1.65,12,19.80,2010-12-01 11:29:00,u16218,United Kingdom
4,536412,22274,FELTCRAFT DOLL EMILY,2.95,2,5.90,2010-12-01 11:49:00,u1792,United Kingdom
5,536425,22585,PACK OF 6 BIRDY GIFT TAGS,1.25,12,15.00,2010-12-01 12:08:00,u13758,United Kingdom
6,536464,22960,JAM MAKING SET WITH JARS,4.25,1,4.25,2010-12-01 12:23:00,u17968,United Kingdom
7,536520,20754,RETROSPOT RED WASHING UP GLOVES,2.10,1,2.10,2010-12-01 12:43:00,u14729,United Kingdom
8,536526,21135,VICTORIAN METAL POSTCARD SPRING,1.69,16,27.04,2010-12-01 12:58:00,u14001,United Kingdom
9,536381,22411,JUMBO SHOPPER VINTAGE RED PAISLEY,1.95,10,19.50,2010-12-01 09:41:00,u15311,United Kingdom

In [12]:
# Selecting invoice from the online_transactions_cleaned table
query = """select count(distinct invoice)
from bootcamp.online_transactions_cleaned
"""

In [13]:
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\2253160645.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

   count
0  21791

In [14]:
# When was the first and last purchase?
query = """ select max(invoice_date) as first_purchase,
                   min(invoice_date) as last_purchase
                   from bootcamp.online_transactions_cleaned"""

In [15]:
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\2253160645.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

       first_purchase       last_purchase
0 2011-12-09 12:50:00 2010-12-01 08:26:00

In [16]:
#How many customers does the table contain?
query ="""select count(distinct customer_id) as customer
from bootcamp.online_transactions_cleaned"""

In [17]:
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\2253160645.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

   customer
0      4363

In [21]:
# What is the most popular stock? (You can look at top 10 sold items - does this differ across markets?)

query ="""select stock_code,description,total_order_value as total_sales
from bootcamp.online_transactions_cleaned 
group by stock_code, description,total_order_value
order by total_order_value desc 
limit 10;
"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\561032962.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

  stock_code                          description  total_sales
0      23843          PAPER CRAFT , LITTLE BIRDIE    168469.60
1      23166       MEDIUM CERAMIC TOP STORAGE JAR     77183.60
2      22502           PICNIC BASKET WICKER SMALL     38970.00
3      23243  SET OF TEA COFFEE SUGAR TINS PANTRY      7144.72
4      21108   FAIRY CAKE FLANNEL ASSORTED COLOUR      6539.40
5      23084                   RABBIT NIGHT LIGHT      4992.00
6     85123A   CREAM HANGING HEART T-LIGHT HOLDER      4921.50
7     85123A   CREAM HANGING HEART T-LIGHT HOLDER      4632.00
8      48185                   DOORMAT FAIRY CAKE      4522.50
9      23173                REGENCY TEAPOT ROSES       4401.00

In [25]:
#What is the average order value i.e. price * quantity?
query = """ select round(avg(total_order_value),2) as average_order_value
from bootcamp.online_transactions_cleaned
"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\1164437944.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

   average_order_value
0                20.72

In [23]:
#How many Stocks have the Description “Unknown”?
query = """select count(description)
from bootcamp.online_transactions_cleaned
where description ='Unknown'
"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\386648617.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

   count
0   1172

In [30]:
#who were the top 10 customers
query = """select customer_id,total_order_value
         from bootcamp.online_transactions_cleaned
         group by customer_id,total_order_value
         order by total_order_value desc
         limit 10"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\1018007100.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

  customer_id  total_order_value
0      u16446          168469.60
1      u12346           77183.60
2      u15098           38970.00
3       u1745            7144.72
4      u15749            6539.40
5      u14646            4992.00
6      u15749            4921.50
7      u15749            4632.00
8      u15749            4522.50
9      u17949            4401.00

In [34]:
# what are the top 10 products
query = """select stock_code,description,total_order_value
         from bootcamp.online_transactions_cleaned
         group by stock_code,description,total_order_value
         order by total_order_value desc
         limit 10"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\3118621430.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

  stock_code                          description  total_order_value
0      23843          PAPER CRAFT , LITTLE BIRDIE          168469.60
1      23166       MEDIUM CERAMIC TOP STORAGE JAR           77183.60
2      22502           PICNIC BASKET WICKER SMALL           38970.00
3      23243  SET OF TEA COFFEE SUGAR TINS PANTRY            7144.72
4      21108   FAIRY CAKE FLANNEL ASSORTED COLOUR            6539.40
5      23084                   RABBIT NIGHT LIGHT            4992.00
6     85123A   CREAM HANGING HEART T-LIGHT HOLDER            4921.50
7     85123A   CREAM HANGING HEART T-LIGHT HOLDER            4632.00
8      48185                   DOORMAT FAIRY CAKE            4522.50
9      23173                REGENCY TEAPOT ROSES             4401.00

In [35]:
#what are the top 10 products sold based on quantity?

query = """select stock_code,description,quantity
         from bootcamp.online_transactions_cleaned
         group by stock_code,description,quantity
         order by quantity desc
         limit 10"""
pd.read_sql(query,connect)

C:\Users\nived\AppData\Local\Temp\ipykernel_5728\175182741.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

  stock_code                         description  quantity
0      23843         PAPER CRAFT , LITTLE BIRDIE     80995
1      23166      MEDIUM CERAMIC TOP STORAGE JAR     74215
2      84826      ASSTD DESIGN 3D PAPER STICKERS     12540
3      84077   WORLD WAR 2 GLIDERS ASSTD DESIGNS      4800
4      22197                      POPCORN HOLDER      4300
5      22053               EMPIRE DESIGN ROSETTE      3906
6      18007                             Unknown      3186
7      21108  FAIRY CAKE FLANNEL ASSORTED COLOUR      3114
8      16014         SMALL CHINESE STYLE SCISSOR      3000
9      84879       ASSORTED COLOUR BIRD ORNAMENT      2880